/* SUAppWindowControllerPriv */

"NOT_NOW_TITLE" = "Ei nyt";
"QUIT_TITLE" = "Lopeta";
"RESCAN_TITLE" = "Etsi nyt";

// these are used in the window header area
"NEW_SOFTWARE_TITLE" = "Tietokoneelle on saatavilla uusia ohjelmistoja.";
"NEW_SOFTWARE_MESSAGE" = "Jos et halua asentaa nyt, valitse Omenavalikko > Ohjelmiston päivitys, kun haluat asentaa.";
// these are used in the window header area and in sheets
"UP_TO_DATE_TITLE" = "Ohjelmisto on ajan tasalla.";
"UP_TO_DATE_MESSAGE" = "Tietokoneelle ei ole uusia ohjelmistoja.";
"UP_TO_DATE_WITH_IGNORED_MESSAGE" = "Päivityksiä on saatavilla vain kohteisiin, jotka olet päättänyt jättää huomioimatta. Yritä myöhemmin uudelleen.";
"RESET_IGNORED_UPDATES_TITLE" = "Palauta huomioimattomat päivitykset";
// these are used only in the error sheet
"FAILED_SCAN_NETWORK_ERROR_TITLE" = "Ohjelmiston päivitys ei voi etsiä päivityksiä verkko-ongelman vuoksi.";
"FAILED_SCAN_OTHER_ERROR_TITLE" = "Päivitysten etsiminen epäonnistui.";
"NETWORK_DIAGNOSTICS_TITLE" = "Verkkodiagnostiikka…";
// these are used only when a non-standard catalog URL is set (Software Update Server)
"FAILED_SCAN_SUS_ERROR_TITLE" = "Ohjelmistopäivityspalvelin (%@) ei vastaa.";
"FAILED_SCAN_SUS_ERROR_MESSAGE" = "Varmista, että verkkoyhteys toimii normaalisti. Jos yhteyden kanssa ei ole ongelmia, pyydä apua verkon ylläpitäjältä.";

// dealing with multiple SU sessions
"OTHER_SESSION_USER_TITLE" = "%@ asentaa päivityksiä.";
"OTHER_SESSION_UNKNOWN_TITLE" = "Toinen käyttäjä asentaa päivityksiä.";
"OTHER_SESSION_SAME_TITLE" = "Päivityksiä asennetaan parhaillaan.";
"OTHER_SESSION_MESSAGE" = "Voit etsiä lisäpäivityksiä myöhemmin valitsemalla Omenavalikosta Ohjelmiston päivitys.";
"OTHER_DONE_USER_TITLE" = "%@ asensi päivitykset. Haluatko etsiä lisäpäivityksiä nyt?";
"OTHER_DONE_UNKNOWN_TITLE" = "Toinen käyttäjä asensi päivitykset. Haluatko etsiä lisäpäivityksiä nyt?";
"OTHER_DONE_SAME_TITLE" =  "Päivitykset asennettiin. Haluatko etsiä lisäpäivityksiä nyt?";
"OTHER_DONE_MESSAGE" = "Jos et halua etsiä nyt, voit etsiä lisäpäivityksiä myöhemmin valitsemalla Omenavalikosta Ohjelmiston päivitys.";

// External Testing Mode Warnings
"DANGER_SIGNATURE_CHECK_OFF_TITLE" = "Varoitus: Applen allekirjoitustarkistus poissa käytöstä";
"DANGER_SIGNATURE_CHECK_OFF_INFO" = "Ohjelmiston päivitystä suoritetaan testitilassa, joka ei ole turvallista normaalikäytössä. Testilassa hyväksytään kaikki ”luotettavat” allekirjoitukset, ei ainoastaan Applen allekirjoitusta. Jos et ole testaamassa muiden valmistajien Apple-ohjelmistopäivityspaketteja, on erittäin suositeltavaa, että lopetat Applen ohjelmistopäivityksen käytön välittömästi.";
"DANGER_SIGNATURE_CHECK_OFF_USE_IN_TEST_BUTTON" = "Käytä testitilaa";
"DANGER_SIGNATURE_CHECK_OFF_QUIT_BUTTON" = "Lopeta";

/* SUAppDetailedView */
"LogOutRequired" = "Sinun on kirjauduttava ulos, kun päivitysten asennus on suoritettu.";
"LogOutRequired_Single" = "Sinun on kirjauduttava ulos, kun päivityksen asennus on suoritettu.";
"RestartRequired" = "Tietokone on käynnistettävä uudelleen, kun päivitysten asennus on suoritettu.";
"RestartRequired_Single" = "Tietokone on käynnistettävä uudelleen, kun päivityksen asennus on suoritettu.";
"ShutDownRequired" = "Tietokone on sammutettava, kun päivitysten asennus on suoritettu.";
"ShutDownRequired_Single" = "Tietokone on sammutettava, kun päivityksen asennus on suoritettu.";
"RestartRecommended" = "On suositeltavaa käynnistää tietokone uudelleen, kun päivitysten asennus on suoritettu.";
"RestartRecommended_Single" = "On suositeltavaa käynnistää tietokone uudelleen, kun päivityksen asennus on suoritettu.";

"Install" = "Asenna";
"Install1Item" = "Asenna 1 kohde";
"InstallNItems" = "Asenna %d kohdetta";

/* Used for AXRoleDescription of restart requirement badges */
"RestartRequirementIndicatorRoleDescription" = "ilmaisin";


/* SUAppProductItem */
"INSTALLED_LABEL" = "Asennettu";
"PARTIALLY_DOWNLOADED_LABEL_FORMAT" = "Osittain ladattu (%d%%)";
"DOWNLOADED_LABEL" = "Ladattu";
"ERROR_LABEL" = "Virhe";

"SELECTION_LABEL_FORMAT" = "%@: %@.";

"DOWNLOAD_MENU_ITEM_GENERIC" = "Siirry Applen lataussivulle…";
"DOWNLOAD_MENU_ITEM_PRODUCT" = "Siirry kohteen ”%@” lataussivulle…";


/* SUAppProductItemController */
"ConfirmMakeInactive1ItemTitle" = "Haluatko varmasti poistaa päivityksen ”%@” luettelosta? ";
"ConfirmMakeInactive1ItemMessage" = "Sinulle ei enää ilmoiteta tämän päivityksen uusista versioista. Jos haluat nähdä tämän päivityksen uudelleen, valitse Ohjelmiston päivitys > Palauta huomioimattomat päivitykset.";
"ConfirmMakeInactiveNItemsTitle" = "Haluatko varmasti poistaa nämä %d päivitystä luettelosta?";
"ConfirmMakeInactiveNItemsMessage" = "Sinulle ei enää ilmoiteta näiden päivitysten uusista versioista. Jos haluat nähdä nämä päivitykset uudelleen, valitse Ohjelmiston päivitys > Palauta huomioimattomat päivitykset.";

"OK_TITLE" = "OK";
"CANCEL_TITLE" = "Kumoa";

"RESCAN_ERROR_TITLE" = "Etsittäessä päivityksiä tapahtui virhe.";
